tests/evidencia/mi-perfil-cambio-contrasena-rendimiento.txt

> horarios-estudiantes@0.0.0 test:perf:password
> artillery run tests/performance/change-password.artillery.yml -o tests/evidencia/mi-perfil-cambio-contrasena-rendimiento.json

Test run id: tja9m_anzd9fmxrbwap9gytenpffpgan846_8gte
Phase started: Warm-up (index: 0, duration: 20s) 21:30:56(-0500)

Phase completed: Warm-up (index: 0, duration: 20s) 21:31:16(-0500)

Phase started: Ramp-up (index: 1, duration: 30s) 21:31:16(-0500)

--------------------------------------
Metrics for period to: 21:31:00(-0500) (width: 2.541s)
--------------------------------------

http.codes.404: ................................................................ 9
http.downloaded_bytes: ......................................................... 1431
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 9
http.response_time:
  min: ......................................................................... 359
  max: ......................................................................... 370
  mean: ........................................................................ 364
  median: ...................................................................... 361.5
  p95: ......................................................................... 368.8
  p99: ......................................................................... 368.8
http.response_time.4xx:
  min: ......................................................................... 359
  max: ......................................................................... 370
  mean: ........................................................................ 364
  median: ...................................................................... 361.5
  p95: ......................................................................... 368.8
  p99: ......................................................................... 368.8
http.responses: ................................................................ 9
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 415.6
  max: ......................................................................... 438.6
  mean: ........................................................................ 424.6
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


--------------------------------------
Metrics for period to: 21:31:10(-0500) (width: 9.554s)
--------------------------------------

http.codes.404: ................................................................ 30
http.downloaded_bytes: ......................................................... 4770
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 30
http.response_time:
  min: ......................................................................... 354
  max: ......................................................................... 379
  mean: ........................................................................ 365.9
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.response_time.4xx:
  min: ......................................................................... 354
  max: ......................................................................... 379
  mean: ........................................................................ 365.9
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.responses: ................................................................ 30
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 409.2
  max: ......................................................................... 440.5
  mean: ........................................................................ 424.4
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


Phase completed: Ramp-up (index: 1, duration: 30s) 21:31:46(-0500)

Phase started: Sustained load (index: 2, duration: 30s) 21:31:46(-0500)

--------------------------------------
Metrics for period to: 21:31:20(-0500) (width: 9.774s)
--------------------------------------

http.codes.404: ................................................................ 36
http.downloaded_bytes: ......................................................... 5724
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 37
http.response_time:
  min: ......................................................................... 359
  max: ......................................................................... 381
  mean: ........................................................................ 367.9
  median: ...................................................................... 368.8
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 359
  max: ......................................................................... 381
  mean: ........................................................................ 367.9
  median: ...................................................................... 368.8
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.responses: ................................................................ 36
vusers.completed: .............................................................. 36
vusers.created: ................................................................ 37
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 37
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 415.5
  max: ......................................................................... 443
  mean: ........................................................................ 427.6
  median: ...................................................................... 424.2
  p95: ......................................................................... 441.5
  p99: ......................................................................... 441.5


--------------------------------------
Metrics for period to: 21:31:30(-0500) (width: 9.728s)
--------------------------------------

http.codes.404: ................................................................ 72
http.downloaded_bytes: ......................................................... 11448
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 75
http.response_time:
  min: ......................................................................... 355
  max: ......................................................................... 1335
  mean: ........................................................................ 380.7
  median: ...................................................................... 368.8
  p95: ......................................................................... 383.8
  p99: ......................................................................... 391.6
http.response_time.4xx:
  min: ......................................................................... 355
  max: ......................................................................... 1335
  mean: ........................................................................ 380.7
  median: ...................................................................... 368.8
  p95: ......................................................................... 383.8
  p99: ......................................................................... 391.6
http.responses: ................................................................ 72
vusers.completed: .............................................................. 72
vusers.created: ................................................................ 75
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 75
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 412
  max: ......................................................................... 1393.9
  mean: ........................................................................ 439.9
  median: ...................................................................... 424.2
  p95: ......................................................................... 441.5
  p99: ......................................................................... 450.4


--------------------------------------
Metrics for period to: 21:31:40(-0500) (width: 9.953s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 2
http.codes.404: ................................................................ 48
http.downloaded_bytes: ......................................................... 7632
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 113
http.response_time:
  min: ......................................................................... 357
  max: ......................................................................... 2520
  mean: ........................................................................ 410.6
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 357
  max: ......................................................................... 2520
  mean: ........................................................................ 410.6
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.responses: ................................................................ 48
vusers.completed: .............................................................. 48
vusers.created: ................................................................ 113
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 113
vusers.failed: ................................................................. 2
vusers.session_length:
  min: ......................................................................... 412
  max: ......................................................................... 2579.1
  mean: ........................................................................ 468.8
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 441.5


--------------------------------------
Metrics for period to: 21:31:50(-0500) (width: 9.896s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 65
http.codes.404: ................................................................ 47
http.downloaded_bytes: ......................................................... 7473
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 140
http.response_time:
  min: ......................................................................... 357
  max: ......................................................................... 376
  mean: ........................................................................ 364.6
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.response_time.4xx:
  min: ......................................................................... 357
  max: ......................................................................... 376
  mean: ........................................................................ 364.6
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.responses: ................................................................ 47
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 140
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 140
vusers.failed: ................................................................. 65
vusers.session_length:
  min: ......................................................................... 412.7
  max: ......................................................................... 435.2
  mean: ........................................................................ 422.2
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


--------------------------------------
Metrics for period to: 21:32:00(-0500) (width: 9.927s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 93
http.codes.404: ................................................................ 47
http.downloaded_bytes: ......................................................... 7473
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 358
  max: ......................................................................... 2506
  mean: ........................................................................ 411.4
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 358
  max: ......................................................................... 2506
  mean: ........................................................................ 411.4
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.responses: ................................................................ 47
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 150
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 150
vusers.failed: ................................................................. 93
vusers.session_length:
  min: ......................................................................... 413.3
  max: ......................................................................... 2564
  mean: ........................................................................ 469.7
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 441.5


--------------------------------------
Metrics for period to: 21:32:10(-0500) (width: 9.924s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 103
http.codes.404: ................................................................ 45
http.downloaded_bytes: ......................................................... 7155
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 357
  max: ......................................................................... 377
  mean: ........................................................................ 363.8
  median: ...................................................................... 361.5
  p95: ......................................................................... 368.8
  p99: ......................................................................... 376.2
http.response_time.4xx:
  min: ......................................................................... 357
  max: ......................................................................... 377
  mean: ........................................................................ 363.8
  median: ...................................................................... 361.5
  p95: ......................................................................... 368.8
  p99: ......................................................................... 376.2
http.responses: ................................................................ 45
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 150
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 150
vusers.failed: ................................................................. 103
vusers.session_length:
  min: ......................................................................... 414.2
  max: ......................................................................... 436.9
  mean: ........................................................................ 422
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


Phase completed: Sustained load (index: 2, duration: 30s) 21:32:16(-0500)

--------------------------------------
Metrics for period to: 21:32:20(-0500) (width: 9.936s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 105
http.codes.404: ................................................................ 36
http.downloaded_bytes: ......................................................... 5724
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 106
http.response_time:
  min: ......................................................................... 358
  max: ......................................................................... 381
  mean: ........................................................................ 366
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.response_time.4xx:
  min: ......................................................................... 358
  max: ......................................................................... 381
  mean: ........................................................................ 366
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 376.2
http.responses: ................................................................ 36
vusers.completed: .............................................................. 36
vusers.created: ................................................................ 106
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 106
vusers.failed: ................................................................. 105
vusers.session_length:
  min: ......................................................................... 413.5
  max: ......................................................................... 441.1
  mean: ........................................................................ 424.3
  median: ...................................................................... 424.2
  p95: ......................................................................... 432.7
  p99: ......................................................................... 432.7


--------------------------------------
Metrics for period to: 21:32:30(-0500) (width: 7.012s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 72
vusers.failed: ................................................................. 72


All VUs finished. Total time: 1 minute, 30 seconds

--------------------------------
Summary report @ 21:32:27(-0500)
--------------------------------

errors.ETIMEDOUT: .............................................................. 440
http.codes.404: ................................................................ 370
http.downloaded_bytes: ......................................................... 58830
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 810
http.response_time:
  min: ......................................................................... 354
  max: ......................................................................... 2520
  mean: ........................................................................ 380.1
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.response_time.4xx:
  min: ......................................................................... 354
  max: ......................................................................... 2520
  mean: ........................................................................ 380.1
  median: ...................................................................... 361.5
  p95: ......................................................................... 376.2
  p99: ......................................................................... 383.8
http.responses: ................................................................ 370
vusers.completed: .............................................................. 370
vusers.created: ................................................................ 810
vusers.created_by_name.Change password endpoint load (non-destructive): ........ 810
vusers.failed: ................................................................. 440
vusers.session_length:
  min: ......................................................................... 409.2
  max: ......................................................................... 2579.1
  mean: ........................................................................ 438.7
  median: ...................................................................... 424.2
  p95: ......................................................................... 441.5
  p99: ......................................................................... 450.4
Log file: tests/evidencia/mi-perfil-cambio-contrasena-rendimiento.json